Revit 2027 API
Application.SharedComponentsLocation Property
 Location of shared components used by Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SharedComponentsLocation { get; }
Public ReadOnly Property SharedComponentsLocation As String
	Get
public:
property String^ SharedComponentsLocation {
	String^ get ();
}
member SharedComponentsLocation : string with get
Property Value
String
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace